In [1]:
import pandas as pd

In [26]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0
[notice] To update, run: C:\Users\abdul\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
df=pd.read_excel("pandas_01_day6 (1).xlsx")

In [29]:
df

           5      25         Biryani
0          5      31         Biryani
1        5.2      48         Biryani
2        5.6      49   Chicken Pulao
3        6Ft      50         Biryani
4        5.6      50           Pasta
..       ...     ...             ...
82  5.8 feet   72 kg         Biryani
83     5' 7"   72 kg         Biryani
84       5.9    75KG   Karahi Ghosht
85     5.7ft    75kg         Biryani
86    Height  weight  Favourite Dish

[87 rows x 3 columns]

In [30]:
df.head()

     5  25        Biryani
0    5  31        Biryani
1  5.2  48        Biryani
2  5.6  49  Chicken Pulao
3  6Ft  50        Biryani
4  5.6  50          Pasta

In [31]:
df.tail()

           5      25         Biryani
82  5.8 feet   72 kg         Biryani
83     5' 7"   72 kg         Biryani
84       5.9    75KG   Karahi Ghosht
85     5.7ft    75kg         Biryani
86    Height  weight  Favourite Dish

In [32]:
df.shape

(87, 3)

In [33]:
df.columns

Index([5, 25, 'Biryani'], dtype='object')

# view dataframe using pandas

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   5        87 non-null     object
 1   25       87 non-null     object
 2   Biryani  86 non-null     object
dtypes: object(3)
memory usage: 2.2+ KB

In [37]:
df.index

RangeIndex(start=0, stop=87, step=1)

In [38]:
df.describe()

           5  25  Biryani
count   87.0  87       86
unique  36.0  46        7
top      5.9  55  Biryani
freq     9.0   6       39

In [39]:
df.T # transpose data mean column convert into row

,0,1,2,3,4,5,6,7,8,9,...,77,78,79,80,81,82,83,84,85,86
5,5,5.2,5.6,6Ft,5.6,5.2,5'8'',5.6,5.5,5.5,...,6'0,5,5.2,5'3'',5.1,5.8 feet,"5' 7""",5.9,5.7ft,Height
25,31,48,49,50,50,51,52,52,52,52,...,125,50kg,61kgs,62 Kgs,62kgs,72 kg,72 kg,75KG,75kg,weight
Biryani,Biryani,Biryani,Chicken Pulao,Biryani,Pasta,Chapel Kaba,Pasta,Chicken Pulao,Karahi Ghosht,Karahi Ghosht,...,Chapel Kaba,Chicken Pulao,\,Biryani,NaN,Biryani,Biryani,Karahi Ghosht,Biryani,Favourite Dish

In [41]:
df.sort_index(ascending=True)

           5      25         Biryani
0          5      31         Biryani
1        5.2      48         Biryani
2        5.6      49   Chicken Pulao
3        6Ft      50         Biryani
4        5.6      50           Pasta
..       ...     ...             ...
82  5.8 feet   72 kg         Biryani
83     5' 7"   72 kg         Biryani
84       5.9    75KG   Karahi Ghosht
85     5.7ft    75kg         Biryani
86    Height  weight  Favourite Dish

[87 rows x 3 columns]

In [42]:
df.sort_index(ascending=False)

           5      25         Biryani
86    Height  weight  Favourite Dish
85     5.7ft    75kg         Biryani
84       5.9    75KG   Karahi Ghosht
83     5' 7"   72 kg         Biryani
82  5.8 feet   72 kg         Biryani
..       ...     ...             ...
4        5.6      50           Pasta
3        6Ft      50         Biryani
2        5.6      49   Chicken Pulao
1        5.2      48         Biryani
0          5      31         Biryani

[87 rows x 3 columns]